{
  "name": "College of Swords",
  "source": "Xanathar's Guide to Everything",
  "description": "Bards of the College of Swords are called blades, and they entertain through daring feats of weapon prowess. Blades perform stunts such as sword swallowing, knife throwing and juggling, and mock combats. Though they use their weapons to entertain, they are also highly trained and skilled warriors in their own right. Their talent with weapons inspires many blades to lead double lives. One blade might use a circus troupe as cover for nefarious deeds such as assassination, robbery, and blackmail. Other blades strike at the wicked, bringing justice to bear against the cruel and powerful.",
  "features": {
    "bonus_proficiencies": {
      "level": 3,
      "description": "You gain proficiency with medium armor and the scimitar. If you’re proficient with a simple or martial melee weapon, you can use it as a spellcasting focus for your bard spells."
    },
    "fighting_style": {
      "level": 3,
      "description": "You adopt a particular style of fighting as your specialty. Choose one of the following options:",
      "options": {
        "dueling": {
          "description": "When you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon."
        },
        "two_weapon_fighting": {
          "description": "When you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack."
        }
      }
    },
    "blade_flourish": {
      "level": 3,
      "description": "You learn to conduct impressive displays of martial prowess and speed. Whenever you take the Attack action on your turn, your walking speed increases by 10 feet until the end of the turn, and if a weapon attack that you make as part of this action hits a creature, you can use one of the following Blade Flourish options of your choice. You can use only one Blade Flourish option per turn.",
      "options": {
        "defensive_flourish": {
          "description": "You can expend one use of your Bardic Inspiration to cause the weapon to deal extra damage to the target you hit. The damage equals the number you roll on the Bardic Inspiration die. You also add the number rolled to your AC until the start of your next turn."
        },
        "slashing_flourish": {
          "description": "You can expend one use of your Bardic Inspiration to cause the weapon to deal extra damage to the target you hit and to any other creature of your choice that you can see within 5 feet of you. The damage equals the number you roll on the Bardic Inspiration die."
        },
        "mobile_flourish": {
          "description": "You can expend one use of your Bardic Inspiration to cause the weapon to deal extra damage to the target you hit. The damage equals the number you roll on the Bardic Inspiration die. You can also push the target up to 5 feet away from you, plus a number of feet equal to the number you roll on that die. You can then immediately use your reaction to move up to your walking speed to an unoccupied space within 5 feet of the target."
        }
      }
    },
    "extra_attack": {
      "level": 6,
      "description": "You can attack twice, instead of once, whenever you take the Attack action on your turn."
    },
    "masters_flourish": {
      "level": 14,
      "description": "Whenever you use a Blade Flourish option, you can roll a d6 and use it instead of expending a Bardic Inspiration die."
    }
  }
}
