{
  "Aasimar": {
    "Description": "Aasimar are mortals who carry a spark of the Upper Planes within their souls. They can fan that spark to bring light, ease wounds, and unleash the fury of the heavens. Aasimar can arise among any population of mortals, resembling their parents but living up to 160 years with subtle celestial features that become more obvious as they mature.",
    "Celestial Features": {
      "1": "A dusting of metallic, white, or charcoal freckles",
      "2": "Metallic, luminous, or dark eyes",
      "3": "Starkly colored hair",
      "4": "An unusual hue tinting your shadow",
      "5": "A ghostly halo crowning your head",
      "6": "Rainbows gleaming on your skin"
    },
    "Ability Score Increase": {
      "Option1": {
        "Score1": "+2",
        "Score2": "+1",
        "Restrictions": "You can't raise any of your scores above 20."
      },
      "Option2": {
        "Score1": "+1",
        "Score2": "+1",
        "Score3": "+1",
        "Restrictions": "You can't raise any of your scores above 20."
      }
    },
    "Creature Type": "Humanoid",
    "Size": {
      "Options": ["Medium", "Small"],
      "Note": "You choose the size when you select this race."
    },
    "Speed": "30 feet",
    "Darkvision": {
      "Range": "60 feet",
      "Description": "You can see in dim light as if it were bright light and in darkness as if it were dim light. You discern colors in darkness only as shades of gray."
    },
    "Celestial Resistance": {
      "Damage Types": ["Necrotic", "Radiant"],
      "Description": "You have resistance to necrotic damage and radiant damage."
    },
    "Healing Hands": {
      "Usage": "As an action",
      "Effect": "Touch a creature and roll a number of d4s equal to your proficiency bonus. The creature regains hit points equal to the total rolled.",
      "Limit": "Once per long rest"
    },
    "Light Bearer": {
      "Cantrip": "Light",
      "Spellcasting Ability": "Charisma"
    },
    "Celestial Revelation": {
      "Activation": "Bonus action",
      "Duration": "1 minute or until ended as a bonus action",
      "Revelations": {
        "Necrotic Shroud": {
          "Description": "Eyes become pools of darkness, ghostly wings sprout. Creatures within 10 feet must succeed on a Charisma saving throw or become frightened. You deal extra necrotic damage equal to your proficiency bonus once per turn.",
          "Save DC": "8 + your proficiency bonus + your Charisma modifier"
        },
        "Radiant Consumption": {
          "Description": "Searing light radiates from your eyes and mouth. You shed bright light in a 10-foot radius and dim light for an additional 10 feet. Each creature within 10 feet takes radiant damage equal to your proficiency bonus at the end of each of your turns. You deal extra radiant damage equal to your proficiency bonus once per turn.",
          "Damage Area": "10 feet"
        },
        "Radiant Soul": {
          "Description": "Luminous, spectral wings sprout. You gain a flying speed equal to your walking speed. You deal extra radiant damage equal to your proficiency bonus once per turn.",
          "Flying Speed": "Equal to your walking speed"
        }
      },
      "Usage Limit": "Once per long rest"
    },
    "Languages": "Common and one additional language chosen with your DM"
  }
}
