{
  "name": "Fairy",
  "source": "Mordenkainen Presents: Monsters of the Multiverse",
  "description": "The Feywild is home to many fantastic peoples, including fairies. Fairies are a wee folk, but not nearly as much so as their pixie and sprite friends. The first fairies spoke Elvish, Goblin, or Sylvan, and encounters with human visitors prompted many of them to learn Common as well.",
  "traits": {
    "ability_score_increase": {
      "description": "When determining your character’s ability scores, increase one score by 2 and increase a different score by 1, or increase three different scores by 1. You can't raise any of your scores above 20."
    },
    "creature_type": {
      "description": "You are a Fey."
    },
    "size": {
      "description": "You are Small."
    },
    "speed": {
      "description": "Your walking speed is 30 feet."
    },
    "fairy_magic": {
      "description": "You know the Druidcraft cantrip. Starting at 3rd level, you can cast the Faerie Fire spell with this trait. Starting at 5th level, you can also cast the Enlarge/Reduce spell with this trait. Once you cast Faerie Fire or Enlarge/Reduce with this trait, you can’t cast that spell with it again until you finish a long rest. You can also cast either of those spells using any spell slots you have of the appropriate level.",
      "spellcasting_ability": "Intelligence, Wisdom, or Charisma (choose when you select this race)"
    },
    "flight": {
      "description": "Because of your wings, you have a flying speed equal to your walking speed. You can’t use this flying speed if you’re wearing medium or heavy armor."
    },
    "languages": {
      "description": "You can speak, read, and write Common and one other language that you and your DM agree is appropriate for the character."
    }
  },
  "fey_characteristics": {
    "description": "Each fairy has a special physical characteristic that sets them apart. Roll on the Fey Characteristics table or choose an option from it. You’re also free to come up with your own characteristic.",
    "table": [
      { "roll": 1, "characteristic": "Your wings are like those of a bird." },
      {
        "roll": 2,
        "characteristic": "You have shimmering, multicolored skin."
      },
      { "roll": 3, "characteristic": "You have exceptionally large ears." },
      {
        "roll": 4,
        "characteristic": "A glittering mist constantly surrounds you."
      },
      {
        "roll": 5,
        "characteristic": "You have a small spectral horn on your forehead, like a little unicorn horn."
      },
      { "roll": 6, "characteristic": "Your legs are insectile." },
      { "roll": 7, "characteristic": "You smell like fresh brownies." },
      {
        "roll": 8,
        "characteristic": "A noticeable, harmless chill surrounds you."
      }
    ]
  }
}
