{
  "name": "Tortle",
  "description": "Tortles are turtle-like humanoids known for their connection to nature and their portable shells, which serve as both home and protection. They often travel along coasts and waterways, and their shells offer them a sense of security wherever they go.",
  "features": {
    "ability_score_increase": {
      "description": "When determining your character’s ability scores, increase one score by 2 and increase a different score by 1, or increase three different scores by 1. You can't raise any of your scores above 20."
    },
    "creature_type": "Humanoid",
    "size": "You are Medium or Small. You choose the size when you select this race.",
    "speed": "Your walking speed is 30 feet.",
    "claws": {
      "description": "You have claws that you can use to make unarmed strikes. When you hit with them, the strike deals 1d6 + your Strength modifier slashing damage, instead of the bludgeoning damage normal for an unarmed strike."
    },
    "hold_breath": {
      "description": "You can hold your breath for up to 1 hour."
    },
    "natural_armor": {
      "description": "Your shell provides you a base AC of 17 (your Dexterity modifier doesn’t affect this number). You can’t wear light, medium, or heavy armor, but if you are using a shield, you can apply the shield’s bonus as normal."
    },
    "natures_intuition": {
      "description": "Thanks to your mystical connection to nature, you gain proficiency with one of the following skills of your choice: Animal Handling, Medicine, Nature, Perception, Stealth, or Survival."
    },
    "shell_defense": {
      "description": "You can withdraw into your shell as an action. Until you emerge, you gain a +4 bonus to your AC, and you have advantage on Strength and Constitution saving throws. While in your shell, you are prone, your speed is 0 and can’t increase, you have disadvantage on Dexterity saving throws, you can’t take reactions, and the only action you can take is a bonus action to emerge from your shell."
    },
    "languages": "You can speak, read, and write Common and one other language that you and your DM agree is appropriate for the character."
  }
}
