{
  "name": "Grave Domain",
  "source": "Xanathar's Guide to Everything",
  "description": "Gods of the Grave Domain oversee the boundary between life and death, advocating respect for the dead and combating undead desecration. They teach their followers to ease the suffering of the dying and ensure the dead find rest. Deities of this domain include Kelemvor, Wee Jas, the Undying Court’s ancestral spirits, Hades, Anubis, and Osiris.",
  "spells": {
    "1st": ["Bane", "False Life"],
    "3rd": ["Gentle Repose", "Ray of Enfeeblement"],
    "5th": ["Revivify", "Vampiric Touch"],
    "7th": ["Blight", "Death Ward"],
    "9th": ["Antilife Shell", "Raise Dead"]
  },
  "features": {
    "circle_of_mortality": {
      "level": 1,
      "description": "When rolling dice to restore hit points with a spell to a creature at 0 hit points, use the highest number possible for each die. You also learn the Spare the Dying cantrip, which has a range of 30 feet and can be cast as a bonus action."
    },
    "eyes_of_the_grave": {
      "level": 1,
      "description": "As an action, you can detect the location of undead within 60 feet of you that aren’t behind total cover or protected from divination magic. This feature can be used a number of times equal to your Wisdom modifier (minimum of once) per long rest."
    },
    "channel_divinity_path_to_the_grave": {
      "level": 2,
      "description": "You can use Channel Divinity to curse a creature within 30 feet of you until the end of your next turn. The next time you or an ally hits the cursed creature, it becomes vulnerable to all damage from that attack, and then the curse ends."
    },
    "sentinel_at_deaths_door": {
      "level": 6,
      "description": "As a reaction, when you or an ally within 30 feet of you suffers a critical hit, you can turn the attack into a normal hit and cancel any effects triggered by the critical hit. This can be used a number of times equal to your Wisdom modifier (minimum of once) per long rest."
    },
    "potent_spellcasting": {
      "level": 8,
      "description": "You add your Wisdom modifier to the damage dealt with any cleric cantrip."
    },
    "keeper_of_souls": {
      "level": 17,
      "description": "When an enemy you can see dies within 30 feet of you, you or one ally within 30 feet of you regains hit points equal to the enemy’s Hit Dice. This feature can be used once per turn."
    }
  }
}
