{
    "description": "Before you became an adventurer, your life was already full of conflict and excitement, because you made a living tracking down people for pay. Unlike some people who collect bounties, though, you aren't a savage who follows quarry into or through the wilderness. You're involved in a lucrative trade, in the place where you live, that routinely tests your skills and survival instincts. What's more, you aren't alone, as a bounty hunter in the wild would be: you routinely interact with both the criminal subculture and other bounty hunters, maintaining contacts in both areas to help you succeed. You might be a cunning thief-catcher, prowling the rooftops to catch one of the myriad burglars of the city. Perhaps you are someone who has your ear to the street, aware of the doings of thieves' guilds and street gangs. You might be a 'velvet mask' bounty hunter, one who blends in with high society and noble circles in order to catch the criminals that prey on the rich, whether pickpockets or con artists. The community where you plied your trade might have been one of Faenûn's great metropolises, such as Waterdeep or Baldur's Gate, or a less populous location, perhaps Luskan or Yartar – any place that's large enough to have a steady supply of potential quarries. As a member of an adventuring party, you might find it more difficult to pursue a personal agenda that doesn't fit with the group's objectives – but on the other hand, you can take down much more formidable targets with the help of your companions.",
    "source": "Sword Coast Adventurer's Guide",
    "skill_proficiencies": ["Deception", "Insight", "Persuasion", "Stealth"],
    "tool_proficiencies": ["One type of gaming set", "One musical instrument", "Thieves' tools"],
    "languages": [],
    "equipment": [
      "A set of clothes appropriate to your duties",
      "A pouch containing 20 gp"
    ],
    "features": {
      "ear_to_the_ground": {
        "description": "You are in frequent contact with people in the segment of society that your chosen quarries move through. These people might be associated with the criminal underworld, the rough-and-tumble folk of the streets, or members of high society. This connection comes in the form of a contact in any city you visit, a person who provides information about the people and places of the local area."
      }
    },
    "suggested_characteristics": {
      "personality_traits": [
        { "d8": 1, "trait": "I always have an eye out for potential bounties, even when I'm not actively hunting." },
        { "d8": 2, "trait": "I maintain a facade of politeness and charm, even when I’m in rough company." },
        { "d8": 3, "trait": "I have a network of informants that keep me updated on local news and gossip." },
        { "d8": 4, "trait": "I am meticulous in my work and leave no detail unchecked." },
        { "d8": 5, "trait": "I am quick to make allies in the criminal underworld, knowing they can be useful." },
        { "d8": 6, "trait": "I enjoy the thrill of the chase and take pride in my tracking skills." },
        { "d8": 7, "trait": "I can blend in with high society when needed, but prefer the company of rougher folks." },
        { "d8": 8, "trait": "I am always ready with a witty remark or a clever excuse to defuse tense situations." }
      ],
      "ideals": [
        { "d6": 1, "ideal": "Justice. I believe in bringing wrongdoers to account for their crimes, no matter their station.", "alignment": "Good" },
        { "d6": 2, "ideal": "Reputation. My success as a bounty hunter depends on maintaining a good reputation among clients and competitors.", "alignment": "Lawful" },
        { "d6": 3, "ideal": "Profit. The more successful I am, the more I earn. I will do whatever it takes to increase my wealth.", "alignment": "Chaotic" },
        { "d6": 4, "ideal": "Independence. I prefer working alone and do not like being bound by rules or regulations.", "alignment": "Neutral" },
        { "d6": 5, "ideal": "Order. Even in my line of work, there must be rules and codes that we follow.", "alignment": "Lawful" },
        { "d6": 6, "ideal": "Survival. In a dangerous world, the ability to adapt and survive is the most valuable trait.", "alignment": "Any" }
      ],
      "bonds": [
        { "d6": 1, "bond": "I have a mentor or ally in the bounty hunting business who has helped me succeed." },
        { "d6": 2, "bond": "I owe my success to a particular city or network of informants and will return the favor when needed." },
        { "d6": 3, "bond": "I have a rival bounty hunter who is both a friend and a competitor. We have a mutual respect for each other." },
        { "d6": 4, "bond": "I seek to capture or bring to justice a particular high-profile target who has eluded me for years." },
        { "d6": 5, "bond": "I am driven by a personal vendetta against a criminal who wronged me or my loved ones." },
        { "d6": 6, "bond": "My reputation is everything to me, and I will go to great lengths to protect it." }
      ],
      "flaws": [
        { "d6": 1, "flaw": "I sometimes become so obsessed with a target that I neglect my other responsibilities." },
        { "d6": 2, "flaw": "I have a tendency to be overly suspicious of others, even those who mean well." },
        { "d6": 3, "flaw": "My need for information can sometimes lead me to betray confidences or break laws." },
        { "d6": 4, "flaw": "I struggle to trust anyone outside of the criminal underworld or my network of informants." },
        { "d6": 5, "flaw": "I can be overly secretive about my own past and motivations, causing mistrust among allies." },
        { "d6": 6, "flaw": "I have a tendency to view every interaction through the lens of a potential transaction or deal." }
      ]
    }
  }
  