{
    "source": "Tomb of Annihilation",
    "description": "You have always been fascinated by other cultures, from the most ancient and primeval lost lands to the most modern civilizations. By studying other cultures' customs, philosophies, laws, rituals, religious beliefs, languages, and art, you have learned how tribes, empires, and all forms of society in between craft their own destinies and doom. This knowledge came to you not only through books and scrolls, but also through firsthand observation – by visiting far-flung settlements and exploring local histories and customs.",
    "skill_proficiencies": ["Insight", "Religion"],
    "tool_proficiencies": "None",
    "languages": "Two of your choice",
    "equipment": [
      "A leather-bound diary",
      "a bottle of ink",
      "an ink pen",
      "a set of traveler's clothes",
      "one trinket of special significance",
      "a pouch containing 10gp"
    ],
    "features": {
      "cultural_chameleon": "Before becoming an adventurer, you spent much of your adult life away from your homeland, living among people different from your kin. You came to understand these foreign cultures and the ways of their people, who eventually treated you as one of their own. One culture had more of an influence on you than any other, shaping your beliefs and customs. Choose a race whose culture you've adopted.",
      "adept_linguist": "You can communicate with humanoids who don't speak any language you know. You must observe the humanoids interacting with one another for at least 1 day, after which you learn a handful of important words, expressions, and gestures – enough to communicate on a rudimentary level."
    },
    "suggested_characteristics": {
      "personality_traits": [
        {"d6": 1, "trait": "I prefer the company of those who aren't like me, including people of other races."},
        {"d6": 2, "trait": "I'm a stickler when it comes to observing proper etiquette and local customs."},
        {"d6": 3, "trait": "I would rather observe than meddle."},
        {"d6": 4, "trait": "By living among violent people, I have become desensitized to violence."},
        {"d6": 5, "trait": "I would risk life and limb to discover a new culture or unravel the secrets of a dead one."},
        {"d6": 6, "trait": "When I arrive at a new settlement for the first time, I must learn all its customs."}
      ],
      "ideals": [
        {"d6": 1, "ideal": "Discovery. I want to be the first person to discover a lost culture. (Any)"},
        {"d6": 2, "ideal": "Distance. One must not interfere with the affairs of another culture – even one in need of aid. (Lawful)"},
        {"d6": 3, "ideal": "Knowledge. By understanding other races and cultures, we learn to understand ourselves. (Any)"},
        {"d6": 4, "ideal": "Power. Common people crave strong leadership, and I do my utmost to provide it. (Lawful)"},
        {"d6": 5, "ideal": "Protection. I must do everything possible to save a society facing extinction. (Good)"},
        {"d6": 6, "ideal": "Indifferent. Life is cruel. What's the point in saving people if they're going to die anyway? (Chaotic)"}
      ],
      "bonds": [
        {"d6": 1, "bond": "My mentor gave me a journal filled with lore and wisdom. Losing it would devastate me."},
        {"d6": 2, "bond": "Having lived among the people of a primeval tribe or clan, I long to return and see how they are faring."},
        {"d6": 3, "bond": "Years ago, tragedy struck the members of an isolated society I befriended, and I will honor them."},
        {"d6": 4, "bond": "I want to learn more about a particular humanoid culture that fascinates me."},
        {"d6": 5, "bond": "I seek to avenge a clan, tribe, kingdom, or empire that was wiped out."},
        {"d6": 6, "bond": "I have a trinket that I believe is the key to finding a long-lost society."}
      ],
      "flaws": [
        {"d6": 1, "flaw": "Boats make me seasick."},
        {"d6": 2, "flaw": "I talk to myself, and I don't make friends easily."},
        {"d6": 3, "flaw": "I believe that I'm intellectually superior to people from other cultures and have much to teach them."},
        {"d6": 4, "flaw": "I've picked up some unpleasant habits living among races such as goblins, lizardfolk, or orcs."},
        {"d6": 5, "flaw": "I complain about everything."},
        {"d6": 6, "flaw": "I wear a tribal mask and never take it off."}
      ]
    }
  }
  