{
    "description": "As a child, you were inquisitive when your playmates were possessive or raucous. In your formative years, you found your way to one of Faerûn's great institutes of learning, where you were apprenticed and taught that knowledge is a more valuable treasure than gold or gems. Now you are ready to leave your home – not to abandon it, but to quest for new lore to add to its storehouse of knowledge. The most well-known of Faerûn's fonts of knowledge is Candlekeep. The great library is always in need of workers and attendants, some of whom rise through the ranks to assume roles of greater responsibility and prominence. You might be one of Candlekeep's own, dedicated to the curatorship of what is likely the most complete body of lore and history in all the world. Perhaps instead you were taken in by the scholars of the Vault of the Sages or the Map House in Silverymoon, and now you have struck out to increase your knowledge and to make yourself available to help those in other places who seek your expertise. You might be one of the few who aid Herald's Holdfast, helping to catalogue and maintain records of the information that arrives daily from across Faerûn.",
    "source": "Sword Coast Adventurer's Guide",
    "skill_proficiencies": ["History", "plus your choice of one from among Arcana, Nature, and Religion"],
    "tool_proficiencies": [],
    "languages": ["Two of your choice"],
    "equipment": [
      "The scholar's robes of your cloister",
      "a writing kit (small pouch with a quill, a bottle of ink, folded parchment, and a small penknife)",
      "a borrowed book on the subject of your current study",
      "a pouch containing 10gp"
    ],
    "features": {
      "library_access": {
        "description": "Though others must often endure extensive interviews and significant fees to gain access to even the most common archives in your library, you have free and easy access to the majority of the library, though it might also have repositories of lore that are too valuable, magical, or secret to permit anyone immediate access. You have a working knowledge of your cloister's personnel and bureaucracy, and you know how to navigate those connections with some ease. Additionally, you are likely to gain preferential treatment at other libraries across the Realms, as professional courtesy shown to a fellow scholar."
      }
    },
    "suggested_characteristics": {
      "personality_traits": [
        { "d8": 1, "trait": "I use polysyllabic words that convey the impression of great erudition." },
        { "d8": 2, "trait": "I've read every book in the world's greatest libraries – or I like to boast that I have." },
        { "d8": 3, "trait": "I'm used to helping out those who aren't as smart as I am, and I patiently explain anything and everything to others." },
        { "d8": 4, "trait": "There's nothing I like more than a good mystery." },
        { "d8": 5, "trait": "I'm willing to listen to every side of an argument before I make my own judgment." },
        { "d8": 6, "trait": "I… speak… slowly… when talking… to idiots,… which… almost… everyone… is… compared… to me." },
        { "d8": 7, "trait": "I am horribly, horribly awkward in social situations." },
        { "d8": 8, "trait": "I'm convinced that people are always trying to steal my secrets." }
      ],
      "ideals": [
        { "1": "Knowledge. The path to power and self-improvement is through knowledge.", "alignment": "Neutral" },
        { "2": 2, "ideal": "Beauty. What is beautiful points us beyond itself toward what is true.", "alignment": "Good" },
        { "3": 3, "ideal": "Logic. Emotions must not cloud our logical thinking.", "alignment": "Lawful" },
        { "4": 4, "ideal": "No Limits. Nothing should fetter the infinite possibility inherent in all existence.", "alignment": "Chaotic" },
        { "5": 5, "ideal": "Power. Knowledge is the path to power and domination.", "alignment": "Evil" },
        { "6": 6, "ideal": "Self-Improvement. The goal of a life of study is the betterment of oneself.", "alignment": "Any" }
      ],
      "bonds": [
        { "1": 1, "bond": "It is my duty to protect my students." },
        { "2": 2, "bond": "I have an ancient text that holds terrible secrets that must not fall into the wrong hands." },
        { "3": 3, "bond": "I work to preserve a library, university, scriptorium, or monastery." },
        { "4": 4, "bond": "My life's work is a series of tomes related to a specific field of lore." },
        { "5": 5, "bond": "I've been searching my whole life for the answer to a certain question." },
        { "6": 6, "bond": "I sold my soul for knowledge. I hope to do great deeds and win it back." }
      ],
      "flaws": [
        { "1": 1, "flaw": "I am easily distracted by the promise of information." },
        { "2": 2, "flaw": "Most people scream and run when they see a demon. I stop and take notes on its anatomy." },
        { "3": 3, "flaw": "Unlocking an ancient mystery is worth the price of a civilization." },
        { "4": 4, "flaw": "I overlook obvious solutions in favor of complicated ones." },
        { "5": 5, "flaw": "I speak without really thinking through my words, invariably insulting others." },
        { "6": 6, "flaw": "I can't keep a secret to save my life, or anyone else's." }
      ]
    }
  }
  
  