{
    "description": "You have served the community where you grew up, standing as its first line of defense against crime. You aren't a soldier, directing your gaze outward at possible enemies. Instead, your service to your hometown was to help police its populace, protecting the citizenry from lawbreakers and malefactors of every stripe. You might have been part of the City Watch of Waterdeep, the baton-wielding police force of the City of Splendors, protecting the common folk from thieves and rowdy nobility alike. Or you might have been one of the valiant defenders of Silverymoon, a member of the Silverwatch or even one of the magic-wielding Spellguard. Perhaps you hail from Neverwinter and have served as one of its Wintershield watchmen, the newly founded branch of guards who vow to keep safe the City of Skilled Hands. Even if you're not city-born or city-bred, this background can describe your early years as a member of law enforcement. Most settlements of any size have their own constables and police forces, and even smaller communities have sheriffs and bailiffs who stand ready to protect their community.",
    "source": "Sword Coast Adventurer's Guide",
    "skill_proficiencies": ["Athletics", "Insight"],
    "tool_proficiencies": "None",
    "languages": ["Two of your choice"],
    "equipment": [
      "A uniform in the style of your unit and indicative of your rank",
      "a horn with which to summon help",
      "a set of manacles",
      "a pouch containing 10gp"
    ],
    "variants": {
      "investigator": {
        "description": "Rarer than watch or patrol members are a community's investigators, who are responsible for solving crimes after the fact. Though such folk are seldom found in rural areas, nearly every settlement of decent size has at least one or two watch members who have the skill to investigate crime scenes and track down criminals. If your prior experience is as an investigator, you have proficiency in Investigation rather than Athletics."
      }
    },
    "features": {
      "watchers_eye": {
        "description": "Your experience in enforcing the law, and dealing with lawbreakers, gives you a feel for local laws and criminals. You can easily find the local outpost of the watch or a similar organization, and just as easily pick out the dens of criminal activity in a community, although you're more likely to be welcome in the former locations rather than the latter."
      }
    },
    "suggested_characteristics": {
      "personality_traits": [
        { "d8": 1, "trait": "I'm always polite and respectful." },
        { "d8": 2, "trait": "I'm haunted by memories of war. I can't get the images of violence out of my mind." },
        { "d8": 3, "trait": "I've lost too many friends, and I'm slow to make new ones." },
        { "d8": 4, "trait": "I'm full of inspiring and cautionary tales from my military experience relevant to almost every combat situation." },
        { "d8": 5, "trait": "I can stare down a hell hound without flinching." },
        { "d8": 6, "trait": "I enjoy being strong and like breaking things." },
        { "d8": 7, "trait": "I have a crude sense of humor." },
        { "d8": 8, "trait": "I face problems head-on. A simple, direct solution is the best path to success." }
      ],
      "ideals": [
        { "d6": 1, "ideal": "Greater Good. Our lot is to lay down our lives in defense of others.", "alignment": "Good" },
        { "d6": 2, "ideal": "Responsibility. I do what I must and obey just authority.", "alignment": "Lawful" },
        { "d6": 3, "ideal": "Independence. When people follow orders blindly, they embrace a kind of tyranny.", "alignment": "Chaotic" },
        { "d6": 4, "ideal": "Might. In life as in war, the stronger force wins.", "alignment": "Evil" },
        { "d6": 5, "ideal": "Live and Let Live. Ideals aren't worth killing over or going to war for.", "alignment": "Neutral" },
        { "d6": 6, "ideal": "Nation. My city, nation, or people are all that matter.", "alignment": "Any" }
      ],
      "bonds": [
        { "d6": 1, "bond": "I would still lay down my life for the people I served with." },
        { "d6": 2, "bond": "Someone saved my life on the battlefield. To this day, I will never leave a friend behind." },
        { "d6": 3, "bond": "My honor is my life." },
        { "d6": 4, "bond": "I'll never forget the crushing defeat my company suffered or the enemies who dealt it." },
        { "d6": 5, "bond": "Those who fight beside me are those worth dying for." },
        { "d6": 6, "bond": "I fight for those who cannot fight for themselves." }
      ],
      "flaws": [
        { "d6": 1, "flaw": "The monstrous enemy we faced in battle still leaves me quivering with fear." },
        { "d6": 2, "flaw": "I have little respect for anyone who is not a proven warrior." },
        { "d6": 3, "flaw": "I made a terrible mistake in battle that cost many lives – and I would do anything to keep that mistake secret." },
        { "d6": 4, "flaw": "My hatred of my enemies is blind and unreasoning." },
        { "d6": 5, "flaw": "I obey the law, even if the law causes misery." },
        { "d6": 6, "flaw": "I'd rather eat my armor than admit when I'm wrong." }
      ]
    }
  }