{
    "description": "You spent years learning the lore of the multiverse. You scoured manuscripts, studied scrolls, and listened to the greatest experts on the subjects that interest you. Your efforts have made you a master in your fields of study.",
    "source": "Player's Handbook",
    "skill_proficiencies": ["Arcana", "History"],
    "tool_proficiencies": [],
    "languages": ["Two of your choice"],
    "equipment": [
      "A bottle of ink",
      "A quill",
      "A small knife",
      "A letter from a dead colleague posing a question you have not yet been able to answer",
      "A set of common clothes",
      "A pouch containing 10 gp"
    ],
    "features": {
      "specialty": {
        "description": "To determine the nature of your scholarly training, roll a d8 or choose from the options in the table below.",
        "options": [
          { "d8": 1, "specialty": "Alchemist" },
          { "d8": 2, "specialty": "Astronomer" },
          { "d8": 3, "specialty": "Discredited academic" },
          { "d8": 4, "specialty": "Librarian" },
          { "d8": 5, "specialty": "Professor" },
          { "d8": 6, "specialty": "Researcher" },
          { "d8": 7, "specialty": "Wizard's apprentice" },
          { "d8": 8, "specialty": "Scribe" }
        ]
      },
      "researcher": {
        "description": "When you attempt to learn or recall a piece of lore, if you do not know that information, you often know where and from whom you can obtain it. Usually, this information comes from a library, scriptorium, university, or a sage or other learned person or creature. Your DM might rule that the knowledge you seek is secreted away in an almost inaccessible place, or that it simply cannot be found. Unearthing the deepest secrets of the multiverse can require an adventure or even a whole campaign."
      }
    },
    "suggested_characteristics": {
      "personality_traits": [
        { "d8": 1, "trait": "I use polysyllabic words that convey the impression of great erudition." },
        { "d8": 2, "trait": "I've read every book in the world's greatest libraries – or I like to boast that I have." },
        { "d8": 3, "trait": "I'm used to helping out those who aren't as smart as I am, and I patiently explain anything and everything to others." },
        { "d8": 4, "trait": "There's nothing I like more than a good mystery." },
        { "d8": 5, "trait": "I'm willing to listen to every side of an argument before I make my own judgment." },
        { "d8": 6, "trait": "I… speak… slowly… when talking… to idiots,… which… almost… everyone… is… compared… to me." },
        { "d8": 7, "trait": "I am horribly, horribly awkward in social situations." },
        { "d8": 8, "trait": "I'm convinced that people are always trying to steal my secrets." }
      ],
      "ideals": [
        { "d6": 1, "ideal": "Knowledge. The path to power and self-improvement is through knowledge.", "alignment": "Neutral" },
        { "d6": 2, "ideal": "Beauty. What is beautiful points us beyond itself toward what is true.", "alignment": "Good" },
        { "d6": 3, "ideal": "Logic. Emotions must not cloud our logical thinking.", "alignment": "Lawful" },
        { "d6": 4, "ideal": "No Limits. Nothing should fetter the infinite possibility inherent in all existence.", "alignment": "Chaotic" },
        { "d6": 5, "ideal": "Power. Knowledge is the path to power and domination.", "alignment": "Evil" },
        { "d6": 6, "ideal": "Self-Improvement. The goal of a life of study is the betterment of oneself.", "alignment": "Any" }
      ],
      "bonds": [
        { "d6": 1, "bond": "It is my duty to protect my students." },
        { "d6": 2, "bond": "I have an ancient text that holds terrible secrets that must not fall into the wrong hands." },
        { "d6": 3, "bond": "I work to preserve a library, university, scriptorium, or monastery." },
        { "d6": 4, "bond": "My life's work is a series of tomes related to a specific field of lore." },
        { "d6": 5, "bond": "I've been searching my whole life for the answer to a certain question." },
        { "d6": 6, "bond": "I sold my soul for knowledge. I hope to do great deeds and win it back." }
      ],
      "flaws": [
        { "d6": 1, "flaw": "I am easily distracted by the promise of information." },
        { "d6": 2, "flaw": "Most people scream and run when they see a demon. I stop and take notes on its anatomy." },
        { "d6": 3, "flaw": "Unlocking an ancient mystery is worth the price of a civilization." },
        { "d6": 4, "flaw": "I overlook obvious solutions in favor of complicated ones." },
        { "d6": 5, "flaw": "I speak without really thinking through my words, invariably insulting others." },
        { "d6": 6, "flaw": "I can't keep a secret to save my life, or anyone else's." }
      ]
    }
  }
  