{
  "name": "Death Domain",
  "source": "Dungeon Master's Guide",
  "description": "Clerics of the Death Domain are deeply connected to the forces of death and the negative energy that gives rise to undead creatures. They may serve deities associated with necromancy, murder, pain, disease, poison, or the underworld. Deities of this domain include Chemosh, Myrkul, Wee Jas, Anubis, Bhaal, Pyremius, Iuz, Loviatar, Incabulos, Talona, Morgion, Hades, and Hel.",
  "spells": {
    "1st": ["False Life", "Ray of Sickness"],
    "3rd": ["Blindness/Deafness", "Ray of Enfeeblement"],
    "5th": ["Animate Dead", "Vampiric Touch"],
    "7th": ["Blight", "Death Ward"],
    "9th": ["Antilife Shell", "Cloudkill"]
  },
  "features": {
    "bonus_proficiency": {
      "level": 1,
      "description": "You gain proficiency with martial weapons."
    },
    "reaper": {
      "level": 1,
      "description": "You learn one necromancy cantrip of your choice. When you cast a necromancy cantrip that normally targets only one creature, it can instead target two creatures within range and within 5 feet of each other."
    },
    "channel_divinity_touch_of_death": {
      "level": 2,
      "description": "You can use your Channel Divinity to deal extra necrotic damage to a creature you hit with a melee attack. The damage equals 5 + twice your cleric level."
    },
    "inescapable_destruction": {
      "level": 6,
      "description": "Necrotic damage dealt by your cleric spells and Channel Divinity options ignores resistance to necrotic damage."
    },
    "divine_strike": {
      "level": 8,
      "description": "You can infuse your weapon strikes with necrotic energy. Once per turn when you hit a creature with a weapon attack, you can cause the attack to deal an additional 1d8 necrotic damage. At 14th level, this extra damage increases to 2d8."
    },
    "improved_reaper": {
      "level": 17,
      "description": "When you cast a necromancy spell of 1st through 5th level that targets only one creature, it can instead target two creatures within range and within 5 feet of each other. You must provide material components for each target if the spell consumes them."
    }
  }
}
