{
  "Hit Points": {
    "Hit Dice": "1d8 per cleric level",
    "Hit Points at 1st Level": "8 + your Constitution modifier",
    "Hit Points at Higher Levels": "1d8 (or 5) + your Constitution modifier per cleric level after 1st"
  },
  "Proficiencies": {
    "Armor": "Light armor, medium armor, heavy armor, shields",
    "Weapons": "Simple weapons",
    "Tools": "None",
    "Saving Throws": "Wisdom, Charisma",
    "Skills": "Choose two from History, Insight, Medicine, Persuasion, and Religion"
  },
  "Equipment": [
    "a mace or a warhammer (if proficient)",
    "a shield",
    "a priest's pack or an explorer's pack",
    "a holy symbol",
    "a set of cleric's robes and a dagger"
  ],
  "Class Features": [
    {
      "levels": ["1"],
      "name": "Spellcasting",
      "desc": "As a conduit for divine power, you can cast cleric spells. Cantrips At 1st level, you know three cantrips of your choice from the cleric spell list. You learn additional cleric cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Cleric table. Spell Slots The Cleric table shows how many spell slots you have to cast your cleric spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest. You prepare the list of cleric spells that are available for you to cast, choosing from the cleric spell list. When you do so, choose a number of cleric spells equal to your Wisdom modifier + your cleric level (minimum of one spell). The spells must be of a level for which you have spell slots. For example, if you are a 3rd-level cleric, you have four 1st-level and two 2nd-level spell slots. With a Wisdom of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell Cure Wounds, you can cast it using a 1st-level or 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells. You can change your list of prepared spells when you finish a long rest. Preparing a new list of cleric spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list. Spellcasting Ability Wisdom is your spellcasting ability for your cleric spells. The power of your spells comes from your devotion to your deity. You use your Wisdom whenever a cleric spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a cleric spell you cast and when making an attack roll with one. Spell save DC = 8 + your proficiency bonus + your Wisdom modifier Spell attack modifier = your proficiency bonus + your Wisdom modifier Ritual Casting You can cast a cleric spell as a ritual if that spell has the ritual tag and you have the spell prepared. Spellcasting Focus You can use a holy symbol as a spellcasting focus for your cleric spells."
    },
    {
      "levels": ["1"],
      "name": "Divine Domain",
      "desc": "At 1st level, you choose a domain shaped by your choice of Deity and the gifts they grant you. Your choice grants you domain spells and other features when you choose it at 1st level. It also grants you additional ways to use Channel Divinity when you gain that feature at 2nd level, and additional benefits at 6th, 8th, and 17th levels."
    },
    {
      "levels": ["2"],
      "name": "Harness Divine Power (Optional)",
      "desc": "At 2nd level, you can expend a use of your Channel Divinity to fuel your spells. As a bonus action, you touch your holy symbol, utter a prayer, and regain one expended spell slot, the level of which can be no higher than half your proficiency bonus (rounded up). The number of times you can use this feature is based on the level you've reached in this class: 2nd level, once; 6th level, twice; and 18th level, thrice. You regain all expended uses when you finish a long rest."
    },
    {
      "levels": ["2", "6", "18"],
      "name": "Channel Divinity",
      "desc": "At 2nd level, you gain the ability to channel divine energy directly from your deity, using that energy to fuel magical effects. You start with two such effects: Turn Undead and an effect determined by your domain. Some domains grant you additional effects as you advance in levels, as noted in the domain description. When you use your Channel Divinity, you choose which effect to create. You must then finish a short or long rest to use your Channel Divinity again. Some Channel Divinity effects require saving throws. When you use such an effect from this class, the DC equals your cleric spell save DC. Beginning at 6th level, you can use your Channel Divinity twice between rests, and beginning at 18th level, you can use it three times between rests. When you finish a short or long rest, you regain your expended uses. Channel Divinity: Turn Undead As an action, you present your holy symbol and speak a prayer censuring the undead. Each undead that can see or hear you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is turned for 1 minute or until it takes any damage. A turned creature must spend its turns trying to move as far away from you as it can, and it can't willingly move to a space within 30 feet of you. It also can't take reactions. For its action, it can use only the Dash action or try to escape from an effect that prevents it from moving. If there's nowhere to move, the creature can use the Dodge action."
    },
    {
      "levels": ["4", "8", "12", "16", "19"],
      "name": "Ability Score Improvement",
      "desc": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature."
    },
    {
      "levels": ["4", "8", "12", "16", "19"],
      "name": "Cantrip Versatility (Optional)",
      "desc": "Whenever you reach a level in this class that grants the Ability Score Improvement feature, you can replace one cantrip you learned from this class's Spellcasting feature with another cantrip from the cleric spell list."
    },
    {
      "levels": ["5", "8", "11", "14", "17"],
      "name": "Destroy Undead",
      "desc": "Starting at 5th level, when an undead fails its saving throw against your Turn Undead feature, the creature is instantly destroyed if its challenge rating is at or below a certain threshold, as shown in the Cleric table above."
    },
    {
      "levels": ["8"],
      "name": "Blessed Strikes (Optional)",
      "desc": "When you reach 8th level, you are blessed with divine might in battle. When a creature takes damage from one of your cantrips or weapon attacks, you can also deal 1d8 radiant damage to that creature. Once you deal this damage, you can't use this feature again until the start of your next turn."
    },
    {
      "levels": ["10"],
      "name": "Divine Intervention",
      "desc": "At 10th level, you can call on your deity to intervene on your behalf in times of great need."
    },
    {
      "levels": ["20"],
      "name": "Divine Intervention Improvement",
      "desc": "At 20th level, your call for intervention succeeds automatically, no roll required."
    }
  ]
}
