{
  "Hit Points": {
    "Hit Dice": "1d8 per warlock level",
    "Hit Points at 1st Level": "8 + your Constitution modifier",
    "Hit Points at Higher Levels": "1d8 (or 5) + your Constitution modifier per warlock level after 1st"
  },
  "Proficiencies": {
    "Armor": "Light armor",
    "Weapons": "Simple weapons",
    "Tools": "None",
    "Saving Throws": "Wisdom, Charisma",
    "Skills": "Choose two from Arcana, Deception, History, Intimidation, Investigation, Nature, and Religion"
  },
  "Equipment": [
    "a light crossbow and 20 bolts or any simple weapon",
    "a component pouch or an arcane focus",
    "a scholar's pack or a dungeoneer's pack",
    "Leather armor, any simple weapon, and two daggers"
  ],
  "Class Features": [
    {
      "name" : "Cantrips Known",
      "desc" : ["2","2","2","3","3","3","3","3","3","4","4","4","4","4","4","4","4","4","4","4"]
    },
    {
      "name" : "Spells Known",
      "desc" : ["2","3","4","5","6","7","8","9","10","11","12","12","13","13","14", "14","15","15","15","15"]
    },
    {
      "name" : "Spell Slots",
      "desc" : ["1","2","2","2","2","2","2","2","2","2","3","3","3","3","3", "3","4","4","4","4"]
    }, 
    {
      "name" : "Slot Level",
      "desc" : ["1","1","2","2","3","3","4","4","5","5","5","5","5","5","5", "5","5","5","5","5"]
    },
    {
        "name" : "Invocations Known",
        "desc" : ["0","2","2","2","3","3","4","4","5","5","5","6","6","6","7", "7","7","8","8","8"]
    },
    {
      "levels" : ["1"],
      "name": "Otherworldly Patron",
      "desc": "At 1st level, you have struck a bargain with an otherworldly being of your choice. Your choice grants you features at 1st level and again at 6th, 10th, and 14th level."
    },
    {
      "levels" : ["1"],
      "name": "Pact Magic",
      "desc": "Your arcane research and the magic bestowed on you by your patron have given you facility with spells. Cantrips You know two cantrips of your choice from the warlock spell list. You learn additional warlock cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Warlock table. Spell Slots The Warlock table shows how many spell slots you have to cast your warlock spells of 1st through 5th level. The table also shows what the level of those slots is; all of your spell slots are the same level. To cast one of your warlock spells of 1st level or higher, you must expend a spell slot. You regain all expended spell slots when you finish a short or long rest. For example, when you are 5th level, you have two 3rd-level spell slots. To cast the 1st-level spell witch bolt, you must spend one of those slots, and you cast it as a 3rd-level spell. Spells Known of 1st Level and Higher At 1st level, you know two 1st-level spells of your choice from the warlock spell list. The Spells Known column of the Warlock table shows when you learn more warlock spells of your choice of 1st level or higher. A spell you choose must be of a level no higher than what's shown in the table's Slot Level column for your level. When you reach 6th level, for example, you learn a new warlock spell, which can be 1st, 2nd, or 3rd level. Additionally, when you gain a level in this class, you can choose one of the warlock spells you know and replace it with another spell from the warlock spell list, which also must be of a level for which you have spell slots. Spellcasting Ability Charisma is your spellcasting ability for your warlock spells, so you use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a warlock spell you cast and when making an attack roll with one. Spell save DC = 8 + your proficiency bonus + your Charisma modifier Spell attack modifier = your proficiency bonus + your Charisma modifier Spellcasting Focus You can use an arcane focus as a spellcasting focus for your warlock spells."
    },
    {
      "levels" : ["2"],
      "name": "Eldritch Invocations",
      "desc": "In your study of occult lore, you have unearthed Eldritch Invocations, fragments of forbidden knowledge that imbue you with an abiding magical ability. At 2nd level, you gain two eldritch invocations of your choice. When you gain certain warlock levels, you gain additional invocations of your choice, as shown in the Invocations Known column of the Warlock table. A level prerequisite refers to your level in this class. Additionally, when you gain a level in this class, you can choose one of the invocations you know and replace it with another invocation that you could learn at that level."
    },
    {
      "levels" : ["3"],
      "name": "Pact Boon",
      "desc": "At 3rd level, your otherworldly patron bestows a gift upon you for your loyal service. You gain one of the following features of your choice: Pact of the Blade, Pact of the Chain, Pact of the Tome, Pact of the Talisman, or Pact of the Star Chain (UA)."
    },
    {
      "levels" : ["4", "8", "12", "16", "19"],
      "name": "Ability Score Improvement",
      "desc": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1."
    },
    {
      "levels" : ["4", "8", "12", "16", "19"],
      "name": "Eldritch Versatility (Optional)",
      "desc": "Whenever you reach a level in this class that grants the Ability Score Improvement feature, you can do one of the following, representing a change of focus in your occult studies: Replace one cantrip you learned from this class's Pact Magic feature with another cantrip from the warlock spell list. Replace the option you chose for the Pact Boon feature with one of that feature's other options. If you're 12th level or higher, replace one spell from your Mystic Arcanum feature with another warlock spell of the same level. If this change makes you ineligible for any of your Eldritch Invocations, you must also replace them now, choosing invocations for which you qualify."
    },
    {
      "levels" : ["11"],
      "name": "Mystic Arcanum",
      "desc": "At 11th level, your patron bestows upon you a magical secret called an arcanum. Choose one 6th-level spell from the warlock spell list as this arcanum. You can cast your arcanum spell once without expending a spell slot. You must finish a long rest before you can do so again. At higher levels, you gain more warlock spells of your choice that can be cast in this way: one 7th-level spell at 13th level, one 8th-level spell at 15th level, and one 9th-level spell at 17th level. You regain all uses of your Mystic Arcanum when you finish a long rest."
    },
    {
      "levels" : ["20"],
      "name": "Eldritch Master",
      "desc": "At 20th level, you can draw on your inner reserve of mystical power while entreating your patron to regain expended spell slots. You can spend 1 minute entreating your patron for aid to regain all your expended spell slots from your Pact Magic feature. Once you regain spell slots with this feature, you must finish a long rest before you can do so again."
    }
  ]
}