{
  "name": "Water Genasi",
  "description": "Water genasi are descendants of marids, aquatic genies from the Elemental Plane of Water. They are perfectly suited to underwater life and embody the power of the waves, with skin often in shades of blue or green and hair resembling seaweed or water.",
  "features": {
    "ability_score_increase": {
      "description": "When determining your character’s ability scores, increase one score by 2 and increase a different score by 1, or increase three different scores by 1. You can't raise any of your scores above 20."
    },
    "creature_type": {
      "description": "You are a Humanoid."
    },
    "size": {
      "description": "You are Medium or Small. You choose the size when you select this race."
    },
    "speed": {
      "description": "Your walking speed is 30 feet, and you have a swimming speed equal to your walking speed."
    },
    "darkvision": {
      "description": "You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
    },
    "acid_resistance": {
      "description": "You have resistance to acid damage."
    },
    "amphibious": {
      "description": "You can breathe air and water."
    },
    "call_to_the_wave": {
      "description": "You know the Acid Splash cantrip. Starting at 3rd level, you can cast the Create or Destroy Water spell with this trait. Starting at 5th level, you can also cast the Water Walk spell with this trait, without requiring a material component. Once you cast Create or Destroy Water or Water Walk with this trait, you can’t cast that spell with it again until you finish a long rest. You can also cast either of those spells using any spell slots you have of the appropriate level. Intelligence, Wisdom, or Charisma is your spellcasting ability for these spells when you cast them with this trait (choose when you select this race)."
    },
    "languages": {
      "description": "You can speak, read, and write Common and one other language that you and your DM agree is appropriate for the character."
    }
  }
}
